[
  {
    "title": "New quantum computing milestone smashes entanglement world record",
    "url": "https://www.livescience.com/technology/computing/new-quantum-computing-milestone-smashes-entanglement-world-record",
    "snippet": "Despite the incredible promise of [quantum computing](https://www.livescience.com/quantum-computing), several key barriers stand in the way of [replacing classical computing](https://www.livescience.com/technology/computing/will-we-ever-have-quantum-laptops). One of these obstacles is controlling [qubits](https://www.livescience.com/technology/computing/what-is-a-quantum-bit-qubit) — the basic units of quantum information — which is extremely difficult. Unlike the binary 1s and 0s of traditional computer bits, qubits operate on an entirely different set of mechanics — [quantum mechanics](https://www.livescience.com/33816-quantum-mechanics-explanation.html), to be precise. While qubits can exist as 1s and 0s, they can also exist as both at the same time, a phenomenon known as [superposition. ](https://www.livescience.com/does-reality-exist-quantum-physics) This makes measuring qubits a major challenge.",
    "content": "New quantum computing milestone smashes entanglement world record\n[News](https://www.livescience.com/news)\n[Owen Hughes](https://www.livescience.com/author/owen-hughes)published\nResearchers have made significant progress in the quest for scalable and fault-tolerant quantum computers after entangling the most logical qubits on record.\nResearchers have set a new record for quantum entanglement — bringing reliable quantum computers a step closer to reality. The scientists successfully entangled 24 \"logical qubits\" — low-error quantum bits of information created by combining multiple physical qubits. This is the highest number ever achieved to date.\nThey also demonstrated that logical qubits can maintain error correction as the number of qubits increases, a crucial step toward larger, more fault-tolerant quantum systems. The researchers detailed their work in a study published Nov. 18 on the preprint database [arXiv](https://arxiv.org/abs/2411.11822).\nDespite the incredible promise of [quantum computing](https://www.livescience.com/quantum-computing), several key barriers stand in the way of [replacing classical computing](https://www.livescience.com/technology/computing/will-we-ever-have-quantum-laptops). One of these obstacles is controlling [qubits](https://www.livescience.com/technology/computing/what-is-a-quantum-bit-qubit) — the basic units of quantum information — which is extremely difficult.\nUnlike the binary 1s and 0s of traditional computer bits, qubits operate on an entirely different set of mechanics — [quantum mechanics](https://www.livescience.com/33816-quantum-mechanics-explanation.html), to be precise. While qubits can exist as 1s and 0s, they can also exist as both at the same time, a phenomenon known as [superposition.](https://www.livescience.com/does-reality-exist-quantum-physics) This makes measuring qubits a major challenge.\nRelated: [Quantum computers are here — but why do we need them and what will they be used for?](https://www.livescience.com/technology/computing/quantum-computers-are-here-but-why-do-we-need-them-and-what-will-they-be-used-for)\nTwo other quantum phenomena, coherence and [entanglement](https://www.livescience.com/what-is-quantum-entanglement.html), throw additional spanners into the works. Coherence is a measure of how long qubits retain the desired state needed to process quantum calculations. Coherence times are usually measured in [fractions of a second](https://www.unsw.edu.au/newsroom/news/2022/09/longest-time-quantum-computing-engineers-set-new-standard-silicon-chip-performance) and can be disrupted by the tiniest of environmental factors.\nWhen qubits lose coherence, they often also lose entanglement — a mechanism whereby the state of one qubit is tied directly to that of another. This loss of coherence and entanglement adversely affects the ability of quantum computers to perform calculations accurately and reliably.\nGet the world’s most fascinating discoveries delivered straight to your inbox.\nEnter ",
    "extraction_method": "direct",
    "timestamp": "2025-09-06T02:26:02.181752",
    "artifact": "1757139962_4f8f446a1e89a01e_livescience.com_technology_computing_new-quantum-computing-milestone-smashes-entanglement-world-reco.html"
  },
  {
    "title": "Breakthrough In Quantum Computing: Distant Qubits Coupled With High Fidelity",
    "url": "https://quantumzeitgeist.com/breakthrough-in-quantum-computing-distant-qubits-coupled-with-high-fidelity/",
    "snippet": "The team’s experiment achieved a coupling strength of 178 MHz, significantly higher than the typical 10 MHz limit. The integration of Quantum Machines’ processor-based OPX control system played a crucial role in this research, providing ultra-fast feedback mechanisms, complex sequencing capabilities, and ease of programming. This technology enables the implementation of fast, high-fidelity two-qubit gates, essential for quantum error correction and complex quantum algorithms. This breakthrough paves the way for more efficient and adaptable quantum circuits, bringing us closer to the realization of practical quantum computers. The research has significant implications for the development of robust quantum systems, and its integration into existing architectures could enhance their performance.",
    "content": "Researchers at TU Delft University, led by Professors Leo Kouwenhoven and Christian K. Andersen, have made a significant breakthrough in quantum computing by demonstrating strong, tunable coupling between two distant superconducting spin qubits. This achievement surpasses traditional photon-mediated spin-spin coupling methods, enabling faster and more efficient quantum gate operations. The team’s experiment achieved a coupling strength of 178 MHz, significantly higher than the typical 10 MHz limit.\nThe integration of Quantum Machines’ processor-based OPX control system played a crucial role in this research, providing ultra-fast feedback mechanisms, complex sequencing capabilities, and ease of programming. This technology enables the implementation of fast, high-fidelity two-qubit gates, essential for quantum error correction and complex quantum algorithms.\nThis breakthrough paves the way for more efficient and adaptable quantum circuits, bringing us closer to the realization of practical quantum computers. The research has significant implications for the development of robust quantum systems, and its integration into existing architectures could enhance their performance.\nThe TU Delft experiment demonstrates the power of real-time flux control using the OPX system, which dynamically adjusts the magnetic flux through superconducting loops to achieve optimal coupling strength between qubits. This capability is crucial for implementing fast, high-fidelity two-qubit gates and switching the coupling on and off as needed.\nThe OPX system’s ultra-fast feedback mechanisms enable continuous monitoring and adjustment of qubit states, improving overall system stability and performance. This is particularly valuable for maintaining coherence and reducing dephasing during qubit operations.\nOne of the most significant implications of this research is the implementation of fast, long-range two-qubit gates. The demonstrated coupling strength of 178 MHz surpasses traditional photon-mediated spin-spin coupling methods, enabling faster and more efficient quantum gate operations.\nThe longitudinal nature of the coupling in this setup offers advantages over transverse coupling, which imposes constraints on qubit frequencies. The strong and tunable coupling achieved in this study can facilitate the implementation of fast, high-fidelity two-qubit gates, essential for quantum error correction and complex quantum algorithms.\nThe integration of advanced control systems like OPX is critical for scalable quantum computing. By providing a comprehensive control solution tailored for quantum technologies, OPX enables researchers to focus on the development of robust quantum computers.\nAs we move forward, it’s clear that this research represents a significant advancement in the quest for scalable quantum computing. The tunable nature of the coupling opens up possibilities for more complex quantum algorithms and error correction methods, essential for the development of high-fid",
    "extraction_method": "direct",
    "timestamp": "2025-09-06T02:26:03.603922",
    "artifact": "1757139963_3796931e20df8933_quantumzeitgeist.com_breakthrough-in-quantum-computing-distant-qubits-coupled-with-high-fidelity_.html"
  },
  {
    "title": "\"Scientists develop novel high-fidelity quantum computing gate\"",
    "url": "https://www.linkedin.com/pulse/scientists-develop-novel-high-fidelity-quantum-gate-ken-wasserman-kogze",
    "snippet": "- [**The New Special Issue \"Quantum Computing with Trapped Ions\" is Open for Submission! ** \\ 8mo](https://www.linkedin.com/pulse/new-special-issue-quantum-computing-trapped-ions-open-submission-suhmc) - [**Quantum computing in 2023: Major theoretical developments** \\ 1y](https://www.linkedin.com/pulse/quantum-computing-2023-major-theoretical-developments-ali-moghaddam-gg1df)",
    "content": "\"Scientists develop novel high-fidelity quantum computing gate\"\n\"Researchers from the RIKEN Center for Quantum Computing and Toshiba have succeeded in building a quantum computer gate based on a double-transmon coupler (DTC), which had been proposed theoretically as a device that could significantly enhance the fidelity of quantum gates.\nUsing this, they achieved a fidelity of 99.92% for a two-qubit device known as a CZ gate and 99.98% for a single-qubit gate. This breakthrough, which was carried out as part of the Q-LEAP project, not only boosts the performance of existing noisy intermediate-scale quantum (NISQ) devices but also helps pave the way for the realization of fault-tolerant quantum computation through effective quantum error correction.\"",
    "extraction_method": "direct",
    "timestamp": "2025-09-06T02:26:04.721977",
    "artifact": "1757139964_f0d99b795053a297_linkedin.com_pulse_scientists-develop-novel-high-fidelity-quantum-gate-ken-wasserman-kogze.html"
  }
]